app/controllers/localizacao_onibuses_controller.rb

SELECT "localizacao_onibuses".* FROM "localizacao_onibuses"
---
  def index
    @localizacao_onibuses = LocalizacaoOnibus.all