app/controllers/onibuses_controller.rb

SELECT "onibuses".* FROM "onibuses"
---
  def index
    @onibuses = Onibus.all

DELETE FROM "onibuses" WHERE "onibuses"."id" = ?  [["id", 1]]
---
  def destroy
    @onibus.destroy

SELECT "onibuses".* FROM "onibuses" WHERE "onibuses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_onibus
      @onibus = Onibus.find(params[:id])